web-security.html
<!doctype html>
<html lang="en">
<head>
<title>Web Security</title>
<!-- 2024-05-17 Fri 11:10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Web Sessions Security</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Session Management</a></li>
<li><a href="#sec-1-2">1.2. Attacks on sessions integrity</a></li>
<li><a href="#sec-1-3">1.3. Session expiration</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Same Origin Policy (SOP)</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Web Origins</a></li>
<li><a href="#sec-2-2">2.2. Cookies VS Web Storage</a></li>
<li><a href="#sec-2-3">2.3. SOP and content inclusion</a></li>
<li><a href="#sec-2-4">2.4. Cross-Origin-Resource-Sharing (CORS)</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Cross-site scripting (XSS)</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. XSS Categories</a></li>
<li><a href="#sec-3-2">3.2. XSS defenses</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Content Security Policy (CSP)</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. CSP directives</a></li>
<li><a href="#sec-4-2">4.2. CSP default restrictions (script-src, default-src)</a></li>
<li><a href="#sec-4-3">4.3. CSP Roadblocks</a></li>
<li><a href="#sec-4-4">4.4. CSP Nonces</a></li>
<li><a href="#sec-4-5">4.5. Supporting dynamic scripts</a></li>
<li><a href="#sec-4-6">4.6. Summary: How to configure CSP?</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Cross-site request forgery</a>
<ul class="nav">
<li><a href="#sec-5-1">5.1. How to prevent CSRF?</a></li>
<li><a href="#sec-5-2">5.2. Double Sumbit</a></li>
<li><a href="#sec-5-3">5.3. SameSite Cookies</a></li>
<li><a href="#sec-5-4">5.4. Vulnerability: Login CSRF</a></li>
<li><a href="#sec-5-5">5.5. CSRF prevention: summary</a></li>
<li><a href="#sec-5-6">5.6. XSS vs CSRF</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Web Security</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Web Sessions Security</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Session Management</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><b>Server-side state</b>: Persist the state information on the server, e.g., in a
database, and use the cookie just to store a session identifier. The database
storing session information can become a bottleneck.
</li>
<li><b>Client-side state</b>: Persist the state information directly into the cookie.
A secure implementation requires the use of cryptography, at least for
signing the cookie and possibly for encrypting it.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Attacks on sessions integrity</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Session hijacking</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
An attacker who gets access to a honest user’s cookies can impersonate her by
presenting such cookies: this attack is known as session hijacking.
</p>

<blockquote>
<p>
<b>HTTP only cookie</b>: Cookies marked with the HttpOnly attribute are not
 accessible to JS, thus offering confidentiality against web attackers.
</p>
</blockquote>

<blockquote>
<p>
<b>Secure cookies</b>: Cookies marked with the Secure attribute are only sent over
 HTTPS and made inaccessible to JavaScript running in HTTP pages. The Secure
 attribute should be used even when the web application is entirely deployed
 over HTTPS.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Session fixation</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Many web applications use <b>pre-sessions</b> (unauthenticated sessions) to keep
track of state information even before login. For example, Most e-commerce
applications allow users to add items to their shopping cart before login for
usability reasons. The content of the cart is persisted upon login to enable
payments. <b>Cookies storing session identifiers should be refreshed every time
the privilege level of the session changes, e.g., upon login</b>. Otherwise, the
web application might be vulnerable to <b>session fixation</b>.
</p>

<blockquote>
<p>
<b>Session fixation through cookie</b>: This method explores the server response to
 fix the Session ID in the victim’s browser. Including the parameter Set-Cookie
 in the HTTP header response, the attacker is able to insert the value of
 Session ID in the cookie and sends it to the victim’s browser.
</p>
</blockquote>
</div>
<ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>Preventing Session fixation<br ><div class="outline-text-5" id="text-1-2-2-1">
<ol class="org-ol">
<li><b>Refresh cookies upon authentication</b>: when the credentials are verified,
change the value of the cookie and start a new session;
</li>
<li><b>Enforce cookie integrity</b>: ensure that the attacker cannot set cookies for
the target web application
</li>
</ol>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Cross-Site-Request-Forgery</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Since cookies are automatically attached to HTTP requests by default, an
attacker can <b>force the creation of authenticated requests from the victim’s
browser</b>, which might trigger security-sensitive actions (CSRF).
</p>

<p>
Discussed below in detail.
</p>
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Cookie forcing</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Cookie forcing is not necessarily dangerous, but can be nasty. <b>Example</b>: Since
paypal.com binds a credit card number to a personal account, an attacker can
perform cookie forcing on paypal.com to eventually <b>get access to the credit
card</b> number of the victim.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Session expiration</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Cookies are deleted by default when the web browser is closed, but web
applications can modify this through the <b>Expires</b> attribute:
</p>
<ul class="org-ul">
<li><b>long session lifetimes</b> improve usability, but might harm security;
</li>
<li>make the <b>“Remember Me”</b> functionality an opt-in.
</li>
</ul>

<p>
<b>Implementation</b>:
</p>
<ul class="org-ul">
<li><b>Server-Side State</b>: Expiration is simple to implement: just invalidate the
session identifier by deleting the corresponding entries from the database.
</li>
<li><b>Client-Side State</b>: Include an expiration date as part of the encrypted data
and implement a blacklist of session cookies issued to compromised accounts.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Same Origin Policy (SOP)</h2>
<div class="outline-text-2" id="text-2">
<p>
The Same Origin Policy (SOP) is the baseline defense mechanism of web browsers,
which isolates data controlled by good.com from read / write accesses by scripts
served from evil.com.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Web Origins</h3>
<div class="outline-text-3" id="text-2-1">
<p>
SOP defines its own isolation domains in terms of origins.
</p>

<blockquote>
<p>
<b>Origin</b>: An origin is a triple including a scheme, a hostname and a port. When
 the port is omitted, the default port of the scheme is implicitly assumed.
</p>
</blockquote>

<blockquote>
<p>
<b>SOP restrictions</b>: At a high level, SOP can be summarized as follows: data
 owned by origin \(o_{1}\) must be isolated from read / write accesses by any
 origin \(o_{2} \neq o_{1}\).
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Cookies VS Web Storage</h3>
<div class="outline-text-3" id="text-2-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left">Cookies</td>
<td class="text-left">Web Storage</td>
</tr>

<tr>
<td class="text-left">- Relaxed SOP (insicure)</td>
<td class="text-left">+ Traditional SOP (more secure)</td>
</tr>

<tr>
<td class="text-left">- Sent automatically (CSRF)</td>
<td class="text-left">+ Sent on demand (no CSRF)</td>
</tr>

<tr>
<td class="text-left">+ HttpOnly: shielded from JS</td>
<td class="text-left">- Always accessible to JS (risky)</td>
</tr>

<tr>
<td class="text-left">+ Sessions are easy to implement</td>
<td class="text-left">- Sessions require custom JS logic</td>
</tr>
</tbody>
</table>

<p>
<b>Cookies + Web Storage = Better sessions</b> against the Session hijacking, session
fixation, CSRF.
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> SOP and content inclusion</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Since the Web is designed to be interconnected, <b>SOP puts very little
restrictions</b> on content inclusion. For example, foo.com can normally load
images and stylesheets from bar.com.
</p>

<blockquote>
<p>
<b>Sub-Resource Integrity</b>: It is possible to enforce integrity checks on included
 scripts, browsers fetching the remote script compare the hash in the integrity
 tag with the hash computed from the downloaded script; if the two hashes do not
 match, the script is not loaded. <b>Difficult to deploy</b>.
</p>
</blockquote>
</div>
</div>
