web-security.org
** Cross-Origin-Resource-Sharing (CORS)
CORS provides a disciplined way to relax the restrictions of SOP:
1) foo.com asks for permission to read cross-origin data;
2) bar.com grants or denies such permission;
3) the browser enforces the authorization decision at foo.com;

#+begin_quote
*CORS headers*:
- *Origin*: request header containing the origin which is asking for
  cross-origin read permission;
- *Access-Control-Allow-Origin*: response header containing the origin to which
  such permission is granted (* for any origin).

  Access is granted iff the content of the Access-Control-Allow-Origin header
  matches the content of the Origin header.
#+end_quote

*** CORS: Non-Simple Requests
#+begin_quote
*CORS headers*:
- *Access-Control-Request-Method*: preflight request header containing the
  method of the non-simple request;
- *Access-Control-Request-Headers*: preflight request header containing the list
  of the custom headers of the non-simple request;
- *Access-Control-Allow-Methods*: preflight response header containing a list of
  allowed methods;
- *Access-Control-Allow-Headers*: preflight response header containing a list of
  allowed custom headers;
- *Access-Control-Max-Age*: preflight response header for caching.
#+end_quote

*** Security of CORS
CORS is a standardized, more secure alternative to JSONP:
1) *No script injection*: though the callee can still respond with arbitrary
   content, the caller can process the response (not a script) before actually
   using it. This is normally done in the XHR callback.
2) *No information leakage*: only credentialed requests might disclose
   confidential information and the callee has control over them, thanks to the
   Access-Control-Allow-Origin header.

* Cross-site scripting (XSS)
Cross Site Scripting (XSS) is the king of client-side attacks, because it allows
the attacker to inject scripts on a vulnerable web application: when a malicious
script runs in the target’s origin, *SOP is ineffective*.

*XSS flow*:
1) the attacker identifies a part of the target web application which processes
   *untrusted input from the user*, e.g., a search field;
2) the attacker discovers that the supplied *input can be eventually interpreted
   as a script*, e.g., using their own browser;
3) the attacker sends a maliciously crafted link to the victim, who accesses it
   and triggers a script injection;
4) since the script actually comes from the target web application, it runs *in
   the same origin of the target*.

** XSS Categories
#+begin_quote
*Type flow*:
- *Reflected XSS*: happens when web applications echo back untrusted user input
  to the client.
- *Persistent XSS*: happens when web applications store untrusted user input
  somewhere and automatically echo it back later.
#+end_quote

#+begin_quote
*Location of flow*:
- *Server-side XSS*: vulnerable code on the server (“traditional” XSS)
- *Client-side XSS*: vulnerable code on the client (DOM-based XSS)
#+end_quote

*** Categories summary
| *Reflected server-side XSS*                               | *Reflected client-side XSS*                               | *Persistent server-side XSS*                   | *Persistent client-side* XSS                    |
| User must visit malicious link                            | User must visit malicious link                            | Attacker can store malicious payload on server | User must visit malicious link, but just once   |
| No persistent change to the server (one attack per visit) | No persistent change to the client (one attack per visit) | Every user of the site affected on every visit | Single user of the site affected on every visit |

*** XSS Polyglot
A polyglot is an exploit working in several different contexts:
#+begin_src javascript
javascript:alert()//"){}alert();//</a><script>alert()</script>
#+end_src

** XSS defenses
| *Output encoding*                                   | *Input Sanitization*                                    |
| Very easy to use                                    | Don’t do it by yourself!                                |
| Solves the root cause of the security vulnerability | Some attacks like markup injection might still be there |
| Sometimes restrictive                               | Sometimes necessary                                     |

* Content Security Policy (CSP)
CSP was born as an industrial effort to design a *declarative client-side
defense* mechanism *against XSS* in 2010:
- Now supported by all major web browsers;
- Useful defense-in-depth (*mitigation*) approach against XSS: it does not
  substitute input sanitization and output encoding;
- No protection against scriptless attacks like HTML markup injection.

A CSP is a *page-level security policy* delivered to the browser via the
*Content-Security-Policy* header. The browser then takes care of enforcing the
policy on the page.

** CSP directives
| *Directive* | *Applies to*                |
| connect-src | Targets of XHRs             |
| img-src     | Images and favicons         |
| object-src  | Plugins (Flash, applets...) |
| script-src  | JavaScript files            |
| style-src   | CSS files                   |
| default-src | Fallback directive          |

** CSP default restrictions (script-src, default-src)
*Script execution*:
- No execution of inline scripts;
- No execution of inline event handlers, e.g., onerror;
- No execution of javascript: URLs.

*String-to-code transformation*:
- Invocation of the eval function is forbidden;
- Functions like setTimeout must be invoked with a callable.

