web-security.html
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Cross-Origin-Resource-Sharing (CORS)</h3>
<div class="outline-text-3" id="text-2-4">
<p>
CORS provides a disciplined way to relax the restrictions of SOP:
</p>
<ol class="org-ol">
<li>foo.com asks for permission to read cross-origin data;
</li>
<li>bar.com grants or denies such permission;
</li>
<li>the browser enforces the authorization decision at foo.com;
</li>
</ol>

<blockquote>
<p>
<b>CORS headers</b>:
</p>
<ul class="org-ul">
<li><b>Origin</b>: request header containing the origin which is asking for
cross-origin read permission;
</li>
<li><b>Access-Control-Allow-Origin</b>: response header containing the origin to which
such permission is granted (* for any origin).

<p>
Access is granted iff the content of the Access-Control-Allow-Origin header
matches the content of the Origin header.
</p>
</li>
</ul>
</blockquote>
</div>
<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> CORS: Non-Simple Requests</h4>
<div class="outline-text-4" id="text-2-4-1">
<blockquote>
<p>
<b>CORS headers</b>:
</p>
<ul class="org-ul">
<li><b>Access-Control-Request-Method</b>: preflight request header containing the
method of the non-simple request;
</li>
<li><b>Access-Control-Request-Headers</b>: preflight request header containing the list
of the custom headers of the non-simple request;
</li>
<li><b>Access-Control-Allow-Methods</b>: preflight response header containing a list of
allowed methods;
</li>
<li><b>Access-Control-Allow-Headers</b>: preflight response header containing a list of
allowed custom headers;
</li>
<li><b>Access-Control-Max-Age</b>: preflight response header for caching.
</li>
</ul>
</blockquote>
</div>
</div>
<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> Security of CORS</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
CORS is a standardized, more secure alternative to JSONP:
</p>
<ol class="org-ol">
<li><b>No script injection</b>: though the callee can still respond with arbitrary
content, the caller can process the response (not a script) before actually
using it. This is normally done in the XHR callback.
</li>
<li><b>No information leakage</b>: only credentialed requests might disclose
confidential information and the callee has control over them, thanks to the
Access-Control-Allow-Origin header.
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Cross-site scripting (XSS)</h2>
<div class="outline-text-2" id="text-3">
<p>
Cross Site Scripting (XSS) is the king of client-side attacks, because it allows
the attacker to inject scripts on a vulnerable web application: when a malicious
script runs in the target’s origin, <b>SOP is ineffective</b>.
</p>

<p>
<b>XSS flow</b>:
</p>
<ol class="org-ol">
<li>the attacker identifies a part of the target web application which processes
<b>untrusted input from the user</b>, e.g., a search field;
</li>
<li>the attacker discovers that the supplied <b>input can be eventually interpreted
as a script</b>, e.g., using their own browser;
</li>
<li>the attacker sends a maliciously crafted link to the victim, who accesses it
and triggers a script injection;
</li>
<li>since the script actually comes from the target web application, it runs <b>in
the same origin of the target</b>.
</li>
</ol>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> XSS Categories</h3>
<div class="outline-text-3" id="text-3-1">
<blockquote>
<p>
<b>Type flow</b>:
</p>
<ul class="org-ul">
<li><b>Reflected XSS</b>: happens when web applications echo back untrusted user input
to the client.
</li>
<li><b>Persistent XSS</b>: happens when web applications store untrusted user input
somewhere and automatically echo it back later.
</li>
</ul>
</blockquote>

<blockquote>
<p>
<b>Location of flow</b>:
</p>
<ul class="org-ul">
<li><b>Server-side XSS</b>: vulnerable code on the server (“traditional” XSS)
</li>
<li><b>Client-side XSS</b>: vulnerable code on the client (DOM-based XSS)
</li>
</ul>
</blockquote>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Categories summary</h4>
<div class="outline-text-4" id="text-3-1-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left"><b>Reflected server-side XSS</b></td>
<td class="text-left"><b>Reflected client-side XSS</b></td>
<td class="text-left"><b>Persistent server-side XSS</b></td>
<td class="text-left"><b>Persistent client-side</b> XSS</td>
</tr>

<tr>
<td class="text-left">User must visit malicious link</td>
<td class="text-left">User must visit malicious link</td>
<td class="text-left">Attacker can store malicious payload on server</td>
<td class="text-left">User must visit malicious link, but just once</td>
</tr>

<tr>
<td class="text-left">No persistent change to the server (one attack per visit)</td>
<td class="text-left">No persistent change to the client (one attack per visit)</td>
<td class="text-left">Every user of the site affected on every visit</td>
<td class="text-left">Single user of the site affected on every visit</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> XSS Polyglot</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
A polyglot is an exploit working in several different contexts:
</p>
<div class="org-src-container">

<pre class="src src-javascript">javascript:alert()<span style="color: #a89984;">//</span><span style="color: #a89984;">"){}alert();//&lt;/a&gt;&lt;script&gt;alert()&lt;/script&gt;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> XSS defenses</h3>
<div class="outline-text-3" id="text-3-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left"><b>Output encoding</b></td>
<td class="text-left"><b>Input Sanitization</b></td>
</tr>

<tr>
<td class="text-left">Very easy to use</td>
<td class="text-left">Don’t do it by yourself!</td>
</tr>

<tr>
<td class="text-left">Solves the root cause of the security vulnerability</td>
<td class="text-left">Some attacks like markup injection might still be there</td>
</tr>

<tr>
<td class="text-left">Sometimes restrictive</td>
<td class="text-left">Sometimes necessary</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Content Security Policy (CSP)</h2>
<div class="outline-text-2" id="text-4">
<p>
CSP was born as an industrial effort to design a <b>declarative client-side
defense</b> mechanism <b>against XSS</b> in 2010:
</p>
<ul class="org-ul">
<li>Now supported by all major web browsers;
</li>
<li>Useful defense-in-depth (<b>mitigation</b>) approach against XSS: it does not
substitute input sanitization and output encoding;
</li>
<li>No protection against scriptless attacks like HTML markup injection.
</li>
</ul>

<p>
A CSP is a <b>page-level security policy</b> delivered to the browser via the
<b>Content-Security-Policy</b> header. The browser then takes care of enforcing the
policy on the page.
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> CSP directives</h3>
<div class="outline-text-3" id="text-4-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left"><b>Directive</b></td>
<td class="text-left"><b>Applies to</b></td>
</tr>

<tr>
<td class="text-left">connect-src</td>
<td class="text-left">Targets of XHRs</td>
</tr>

<tr>
<td class="text-left">img-src</td>
<td class="text-left">Images and favicons</td>
</tr>

<tr>
<td class="text-left">object-src</td>
<td class="text-left">Plugins (Flash, applets&#x2026;)</td>
</tr>

<tr>
<td class="text-left">script-src</td>
<td class="text-left">JavaScript files</td>
</tr>

<tr>
<td class="text-left">style-src</td>
<td class="text-left">CSS files</td>
</tr>

<tr>
<td class="text-left">default-src</td>
<td class="text-left">Fallback directive</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> CSP default restrictions (script-src, default-src)</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<b>Script execution</b>:
</p>
<ul class="org-ul">
<li>No execution of inline scripts;
</li>
<li>No execution of inline event handlers, e.g., onerror;
</li>
<li>No execution of javascript: URLs.
</li>
</ul>

<p>
<b>String-to-code transformation</b>:
</p>
<ul class="org-ul">
<li>Invocation of the eval function is forbidden;
</li>
<li>Functions like setTimeout must be invoked with a callable.
</li>
</ul>
</div>
</div>
