web-security.org
** CSP Roadblocks
1) *Whitelist*: The simplest way to build whitelists is to enforce a restrictive
   CSP as report-only via the *Content-Security-Policy-Report-Only* header;
2) *Inline Scripts and Friends*: CSP forbids inline scripts, event handlers and
   javascript, so one has to:
   1) Move inline scripts to external files;
   2) Replace event handlers with listeners registered by external scripts;
   3) Replace javascript: URLs with script-initiated code.
3) *String-to-Code Transformations*: Functions like eval and setTimeout can be
   used to transform strings into code, thus leading to injections.

** CSP Nonces
CSP can now be used to whitelist scripts (inline or external) bearing a *valid
nonce*, i.e., a random, unpredictable string:
#+begin_src html
script-src ’self’ https://example.com ’nonce-54321’; default-src ’self’
#+end_src

Individual inline scripts can be whitelisted using the nonce attribute (the same
nonce can be used for many inline scripts):
#+begin_src html
<script nonce="54321"> alert(1); </script>
#+end_src

*Nonces advantages*:
- They provide support for inline scripts, without falling back to the complete
  absence of security of ’unsafe-inline’;
- They whitelist individual scripts as opposed to entire origins, which
  simplifies the security auditing

#+begin_quote
The developer is in charge of generating random, unpredictable nonces on each
incoming request and populating the CSP header correctly: *Nonce reuse can
easily break protection against XSS*.
#+end_quote

** Supporting dynamic scripts
Make use of the *’strict-dynamic’* keyword, which propagates trust from
nonce-authorized scripts to the new scripts they insert.

Or, *CSP hashes*: Hashes provide better security guarantees than nonces, because
they take the actual script code into account.
#+begin_src html
script-src ’sha512-YWIzOWNiNzJjNDRlY’;
#+end_src
The following inline script will be executed, under the assumption that the
SHA-512 hash of its body is YWIzOWNiNzJjNDRlY:
#+begin_src html
<script> alert(1); </script>
#+end_src

#+begin_quote
*’strict-dynamic’ also covers hash-authorized scripts*.
#+end_quote

** Summary: How to configure CSP?
1) *whitelist-based*: often *insecure*. Even assuming CSP best practices are
   followed, it is basically impossible to vet entire origins;
2) *nonce-based*: *more secure, but no guarantees* about the executed script
   content. Be aware of the dangers of ’strict-dynamic’;
3) *hash-based*: *complete control* of the executed scripts, including their
   content, but often *too complicated to deploy* in practice.


* Cross-site request forgery
CSRF is enabled by the attachment of session cookies to HTTP requests forged by
malicious pages.

** How to prevent CSRF?
- *Server-side fixes*: Do not authenticate requests based on cookies alone;
- *Client-side fixes*: Change the way cookies work: modern browsers offer a
  native protection mechanism via the *SameSite* cookie attribute.

#+begin_quote
*Referer checking*: A possible defense against CSRF is checking the content of
 the Referer header of security-sensitive HTTP requests. This header contains
 the full URL of the page which sent the request.
#+end_quote

#+begin_quote
*Origin checking*: Rather than checking the value of the Referer header, one can
 check the value of the Origin header introduced for CORS:
 - *privacy-friendly* version of Referer: it includes just the origin, not the
   entire URL;
 - always attached to XHR requests by default
 - in modern browsers: also attached to cross-origin *POST requests*, e.g., upon
   form submission

 In general, *Origin checking should be preferred over Referer checking*, but the
 two mechanisms share similar limitations.
#+end_quote

#+begin_quote
*Custom headers*: Another defense relies on custom headers, e.g., *CSRF-Protection: 1*. The presence of the header already suffices and its value is unimportant, since SOP prevents the use of custom headers on cross-origin requests.
#+end_quote

#+begin_quote
*Secret tokens*: The most common defense against CSRF deployed in the wild is the inclusion of secret tokens as part of security-sensitive requests. The expected value of the secret token is typically stored in the user’s session at the server side: only requests bearing a valid token are processed by the web application.
#+end_quote

** Double Sumbit
The *double submit pattern* is a popular approach to the use of tokens:
- the token is still embedded as a parameter of each sensitive HTTP request, as
  in the previous example, *but the right value of the token is stored inside a
    cookie* (rather than in the session);
- Every time a sensitive HTTP request is received, *the server checks that the
    value of the cookie matches the value of the parameter*;
- As before: the attacker cannot craft a request with the right value of the parameter (unless they know the value of the cookie).

*** Double Submit: Cookie confidentiality
Since the double submit pattern stores a secret token inside a cookie, the confidentiality of the cookie must be ensured:
- Mark the cookie with the *Secure* attribute to prevent its disclosure;
- Perhaps surprisingly, notice that the *HttpOnly attribute does not
  provide much help* here!

*Secure implementation*: Alternatively, adopt the Secure- prefix to ensure
cookie integrity.

** SameSite Cookies
Cookies marked with the *SameSite attribute* can be configured so that they are
not attached to cross-site requests:
- *site = registrable domain* (e.g., google.com) and its subdomains;
- *SameSite=Strict*: applies this policy to every HTTP request, thus
offering high security, but with the risk of breaking web applications
- *SameSite=Lax*: relaxes this restriction in the case of top-level navigations
  with a safe method, e.g., resulting from clicking a link

This defense is simple and effective, but it does not offer protection to legacy
browsers, hence also more traditional defenses like tokens should be
implemented.

