web-security.org
** Vulnerability: Login CSRF
If the login form of a web application is not protected against CSRF, the
attacker can force the victim into authenticating using the attacker’s account:
this attack is known as *login CSRF*.

*Defense*:
- *header checks* upon login form submission;
- *secret tokens* in the login form: since login CSRF happens before the
  authenticated session, you must setup a pre-session for the token (commonly
  used);
- *SameSite cookies*: just require the presence of a SameSite cookie upon login
  form submission. This requires enforcing cookie integrity against network
  attackers, otherwise the cookie could be forged

** CSRF prevention: summary
1) Checking the content of the Referer / Origin header or the mere
   presence of custom headers might work, but this is often impractical;
1) Secret tokens are better for most applications, but implementation is not
   straightforward;
3) SameSite cookies are a simple and elegant solution against CSRF, which solves
   the issues of tokens, but only protects modern browsers and a part of the
   state-changing requests.

   *Best practice: SameSite cookies + secret tokens.*

** XSS vs CSRF
Both XSS and CSRF are dangerous attacks. Notice that:
- if a web application is vulnerable against XSS, none of the proposed defenses
  against CSRF is effective, because *the attacker operates from a same-site
  position*. This means that XSS is a more serious security concern than CSRF in
  most cases.
