web-security.html
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Vulnerability: Login CSRF</h3>
<div class="outline-text-3" id="text-5-4">
<p>
If the login form of a web application is not protected against CSRF, the
attacker can force the victim into authenticating using the attacker’s account:
this attack is known as <b>login CSRF</b>.
</p>

<p>
<b>Defense</b>:
</p>
<ul class="org-ul">
<li><b>header checks</b> upon login form submission;
</li>
<li><b>secret tokens</b> in the login form: since login CSRF happens before the
authenticated session, you must setup a pre-session for the token (commonly
used);
</li>
<li><b>SameSite cookies</b>: just require the presence of a SameSite cookie upon login
form submission. This requires enforcing cookie integrity against network
attackers, otherwise the cookie could be forged
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> CSRF prevention: summary</h3>
<div class="outline-text-3" id="text-5-5">
<ol class="org-ol">
<li>Checking the content of the Referer / Origin header or the mere
presence of custom headers might work, but this is often impractical;
</li>
<li>Secret tokens are better for most applications, but implementation is not
straightforward;
</li>
<li>SameSite cookies are a simple and elegant solution against CSRF, which solves
the issues of tokens, but only protects modern browsers and a part of the
state-changing requests.

<p>
<b>Best practice: SameSite cookies + secret tokens.</b>
</p>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> XSS vs CSRF</h3>
<div class="outline-text-3" id="text-5-6">
<p>
Both XSS and CSRF are dangerous attacks. Notice that:
</p>
<ul class="org-ul">
<li>if a web application is vulnerable against XSS, none of the proposed defenses
against CSRF is effective, because <b>the attacker operates from a same-site
position</b>. This means that XSS is a more serious security concern than CSRF in
most cases.
</li>
</ul>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2024-05-17 Fri 11:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="http://orgmode.org">Org-mode</a> 9.7)</p>
</div>
</footer>
</body>
</html>
